In [36]:
people = {
    "first": ['Corey', 'Jane', 'John', 'Adam'],
    "last": ['Schafer', 'Doe', 'Doe', 'Doe'],
    "email": ['coreschafter8@gmail.com', 'janedoe@gmail.com','Johndoe@gmail.com', 'A@email.com']
}

In [37]:
import pandas as pd

In [38]:
df = pd.DataFrame(people)

In [23]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [24]:
df.sort_values(by='last', ascending=False)

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [39]:
df.sort_values(by=['last', 'first'], ascending=False)

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
2   John      Doe        Johndoe@gmail.com
1   Jane      Doe        janedoe@gmail.com
3   Adam      Doe              A@email.com

In [42]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)

In [43]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
3   Adam      Doe              A@email.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [45]:
df.sort_index()

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com
3   Adam      Doe              A@email.com

In [46]:
df['last'].sort_values()

3        Doe
1        Doe
2        Doe
0    Schafer
Name: last, dtype: object